#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

module.demo.azurerm_resource_group.network: Refreshing state... [id=/subscriptions/78f26f10-0e60-4293-8a7e-122584ccb40d/resourceGroups/cq-network-rg]
module.demo.azurerm_route_filter.route_filter: Refreshing state... [id=/subscriptions/78f26f10-0e60-4293-8a7e-122584ccb40d/resourceGroups/cq-network-rg/providers/Microsoft.Network/routeFilters/cq-route-filter]
module.demo.azurerm_virtual_network.example: Refreshing state... [id=/subscriptions/78f26f10-0e60-4293-8a7e-122584ccb40d/resourceGroups/cq-network-rg/providers/Microsoft.Network/virtualNetworks/cq-vnet-example]
module.demo.azurerm_public_ip.example: Refreshing state... [id=/subscriptions/78f26f10-0e60-4293-8a7e-122584ccb40d/resourceGroups/cq-network-rg/providers/Microsoft.Network/publicIPAddresses/cq-virtual-network-gateway-public-ip]
module.demo.azurerm_virtual_wan.virtual_wan: Refreshing state... [id=/subscriptions/78f26f10-0e60-4293-8a7e-122584ccb40d/resourceGroups/cq-network-rg/providers/Microsoft.Network/virtualWans/cq-er-virtualwan]
module.demo.azurerm_express_route_circuit.er_circuit: Refreshing state... [id=/subscriptions/78f26f10-0e60-4293-8a7e-122584ccb40d/resourceGroups/cq-network-rg/providers/Microsoft.Network/expressRouteCircuits/cq-circuit]
module.demo.azurerm_express_route_port.er_port: Refreshing state... [id=/subscriptions/78f26f10-0e60-4293-8a7e-122584ccb40d/resourceGroups/cq-network-rg/providers/Microsoft.Network/expressRoutePorts/cq-er-port]
module.demo.azurerm_virtual_hub.virtual_hub: Refreshing state... [id=/subscriptions/78f26f10-0e60-4293-8a7e-122584ccb40d/resourceGroups/cq-network-rg/providers/Microsoft.Network/virtualHubs/cq-er-virtualhub]
module.demo.azurerm_subnet.example: Refreshing state... [id=/subscriptions/78f26f10-0e60-4293-8a7e-122584ccb40d/resourceGroups/cq-network-rg/providers/Microsoft.Network/virtualNetworks/cq-vnet-example/subnets/cq-vnet-subnet-example]
module.demo.azurerm_express_route_gateway.gateway: Refreshing state... [id=/subscriptions/78f26f10-0e60-4293-8a7e-122584ccb40d/resourceGroups/cq-network-rg/providers/Microsoft.Network/expressRouteGateways/cq-er-gateway]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.demo.azurerm_subnet.example has been deleted
  - resource "azurerm_subnet" "example" {
      - id                                             = "/subscriptions/78f26f10-0e60-4293-8a7e-122584ccb40d/resourceGroups/cq-network-rg/providers/Microsoft.Network/virtualNetworks/cq-vnet-example/subnets/cq-vnet-subnet-example" -> null
        name                                           = "cq-vnet-subnet-example"
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.demo.azurerm_subnet.example will be created
  + resource "azurerm_subnet" "example" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.0.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = "GatewaySubnet"
      + resource_group_name                            = "cq-network-rg"
      + virtual_network_name                           = "cq-vnet-example"
    }

  # module.demo.azurerm_virtual_network_gateway.example will be created
  + resource "azurerm_virtual_network_gateway" "example" {
      + active_active       = (known after apply)
      + enable_bgp          = (known after apply)
      + generation          = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "cq-er-virtual-network-gateway"
      + resource_group_name = "cq-network-rg"
      + sku                 = "Basic"
      + type                = "Vpn"
      + vpn_type            = "RouteBased"

      + bgp_settings {
          + asn             = (known after apply)
          + peer_weight     = (known after apply)
          + peering_address = (known after apply)

          + peering_addresses {
              + apipa_addresses       = (known after apply)
              + default_addresses     = (known after apply)
              + ip_configuration_name = (known after apply)
              + tunnel_ip_addresses   = (known after apply)
            }
        }

      + ip_configuration {
          + name                          = "vnetGatewayConfig"
          + private_ip_address_allocation = "Dynamic"
          + public_ip_address_id          = "/subscriptions/78f26f10-0e60-4293-8a7e-122584ccb40d/resourceGroups/cq-network-rg/providers/Microsoft.Network/publicIPAddresses/cq-virtual-network-gateway-public-ip"
          + subnet_id                     = (known after apply)
        }
    }

  # module.demo.azurerm_virtual_network_gateway_connection.onpremise will be created
  + resource "azurerm_virtual_network_gateway_connection" "onpremise" {
      + connection_mode                    = "Default"
      + connection_protocol                = (known after apply)
      + enable_bgp                         = (known after apply)
      + express_route_gateway_bypass       = (known after apply)
      + id                                 = (known after apply)
      + location                           = "eastus"
      + name                               = "cq-er-virtual-network-gateway-connection"
      + resource_group_name                = "cq-network-rg"
      + routing_weight                     = (known after apply)
      + type                               = "IPsec"
      + use_policy_based_traffic_selectors = (known after apply)
      + virtual_network_gateway_id         = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```

</details>

*Pusher: @erezrokah, Action: `pull_request_target`, Working Directory: ``, Workflow: `terraform_plan`*